---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MechanicalUtils
source: html/bf566f7b-e3fc-f76b-4605-a47b900b012a.htm
---
# MechanicalUtils Methods

Breaks the duct curve into two parts at the given position.